In [1]:
#____MISSING_DATA____

In [3]:
# options for missing data :
#1/keep it,2/remove it,3/replace it

In [4]:
import pandas as pd
import numpy as np

In [10]:
np.nan#we gonna focus on this because it will be how datasets are displayed

nan

In [11]:
pd.NA

In [12]:
pd.NaT

NaT

In [13]:
#typical comperesense should be avoided with missing values :

In [14]:
np.nan == np.nan

False

In [16]:
np.nan is np.nan#this how to test if a value is a 'nan'

True

myvar = np.nan

In [19]:
#myvar is np.nan

In [20]:
df = pd.read_csv(r'C:\Users\lenovo\Desktop\Notebooks\03-Pandas\movie_scores.csv')

In [21]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [23]:
df.shape

(5, 6)

In [24]:
#detecting null values

In [25]:
df.isnull()#returning a boolen series

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0       False      False  False  False            False             False
1        True       True   True   True             True              True
2       False      False  False  False             True              True
3       False      False  False  False            False             False
4       False      False  False  False            False             False

In [26]:
#detecting non values :

In [27]:
df.notnull()

   first_name  last_name    age    sex  pre_movie_score  post_movie_score
0        True       True   True   True             True              True
1       False      False  False  False            False             False
2        True       True   True   True            False             False
3        True       True   True   True             True              True
4        True       True   True   True             True              True

In [28]:
#you can event test on a single or multiple columns :
df['pre_movie_score'].notnull()

0     True
1    False
2    False
3     True
4     True
Name: pre_movie_score, dtype: bool

In [29]:
#we can use the prevous tests as filtres

In [30]:
df[df['pre_movie_score'].notnull()]

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [31]:
#let's now talk about the three options that we mentioned on the top :

In [32]:
#1/keep it :

In [33]:
df

  first_name last_name   age  sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0    m              8.0              10.0
1        NaN       NaN   NaN  NaN              NaN               NaN
2       Hugh   Jackman  51.0    m              NaN               NaN
3      Oprah   Winfrey  66.0    f              6.0               8.0
4       Emma     Stone  31.0    f              7.0               9.0

In [34]:
#2/drop it

In [47]:
#help(df.dropna())

In [39]:
df.dropna()#drop any row that have any missing value:

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [48]:
df.dropna(thresh=1)#drop any row that didn't  have at least 1 not 'nan' value:

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [49]:
df.dropna(thresh=5)

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [50]:
df.dropna(axis = 1)#is gonna drop all columns because every one of them have at least one 'nan' value:

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [51]:
df.dropna(subset=['last_name'])#it will just consider the wanted column when it checks null values :

  first_name last_name   age sex  pre_movie_score  post_movie_score
0        Tom     Hanks  63.0   m              8.0              10.0
2       Hugh   Jackman  51.0   m              NaN               NaN
3      Oprah   Winfrey  66.0   f              6.0               8.0
4       Emma     Stone  31.0   f              7.0               9.0

In [52]:
#3/fill it :

In [53]:
#help(df.fillna)

In [55]:
df.fillna('1215')#replace every single value with '1215' :

  first_name last_name   age   sex pre_movie_score post_movie_score
0        Tom     Hanks  63.0     m             8.0             10.0
1       1215      1215  1215  1215            1215             1215
2       Hugh   Jackman  51.0     m            1215             1215
3      Oprah   Winfrey  66.0     f             6.0              8.0
4       Emma     Stone  31.0     f             7.0              9.0

In [58]:
df['pre_movie_score'].fillna(0)#filling values for a specific column / you can do it for multiipe column :

0    8.0
1    0.0
2    0.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [60]:
#you fill it with functions return :
df['pre_movie_score'].fillna(df['pre_movie_score'].mean())

0    8.0
1    7.0
2    7.0
3    6.0
4    7.0
Name: pre_movie_score, dtype: float64

In [62]:
df['pre_movie_score'].interpolate()#using other values to fill the missing ones :

0    8.000000
1    7.333333
2    6.666667
3    6.000000
4    7.000000
Name: pre_movie_score, dtype: float64